EA/src/Documents/Чеки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>Чеки</Name>
			<BasedOn>
				<xr:Item>Document.Заказ</xr:Item>
				<xr:Item>Document.Чеки</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОтправкаСМС</xr:Item>
				<xr:Item>AccumulationRegister.ХранениеЗСЯ</xr:Item>
				<xr:Item>AccumulationRegister.Реализация</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредстваККМ</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>InformationRegister.ТабПродажиАстраЗенека</xr:Item>
				<xr:Item>InformationRegister.t_astro_used_booklets</xr:Item>
				<xr:Item>AccumulationRegister.ХранениеЗСЯПоТоварам</xr:Item>
				<xr:Item>InformationRegister.КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ККМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Чеки</v8:Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипЦены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RRN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>authcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧека</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСмены</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаПоКарте</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКарты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТорговыеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реализация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Чеки</v8:Type>
								<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дисконт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Себестоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКомплектацииЗаказа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипКомплектацииЗаказа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипЦены</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗСЯ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестоЗСЯ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НуженРецепт</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удалить_Операц</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТорговыеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удалить_НомерСтрокиТабличнойЧастиДокументаОснования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удалить_ЧЧ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удалить_ММ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаСкидочныеПрограммы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>OPERDATE</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CARDNUMBER</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>19</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Line</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>LineDoc</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>id_Товар</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>PRODUCTCODE</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>13</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>project</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкидочныеПрограммыПоКарте</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИспользованныеБуклеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>booklet_barcode</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>19</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>t_check_h_id</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>check_date</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписаниеПакетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоЗаказа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаклейкиМестЗаказа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗСЯ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МестоЗСЯ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

EA/src/Documents/Чеки/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ОстаткиТовара.Очистить();
	Движения.ОстаткиТовара.Записывать = Истина;
	
	Движения.Реализация.Очистить();
	Движения.Реализация.Записывать = Истина;
	
	Движения.КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯ.Очистить();
	Движения.КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯ.Записывать = Истина;
	
	Движения.ХранениеЗСЯ.Очистить();
	Движения.ХранениеЗСЯ.Записывать = Истина;
	
	Движения.ХранениеЗСЯПоТоварам.Очистить();
	Движения.ХранениеЗСЯПоТоварам.Записывать = Истина;
	
	Движения.ДенежныеСредстваККМ.Очистить();
	Движения.ДенежныеСредстваККМ.Записывать = Истина;
	
	Движения.ТабПродажиАстраЗенека.Очистить();
	Движения.ТабПродажиАстраЗенека.Записывать = Истина;
	
	Движения.t_astro_used_booklets.Очистить();
	Движения.t_astro_used_booklets.Записывать = Истина;
	
	ТаблицаДокументов = Реализация.Выгрузить(,"Документ,ТипКомплектацииЗаказа,ЗСЯ"); 
	ТаблицаДокументов.Свернуть("Документ,ТипКомплектацииЗаказа,ЗСЯ");
		
	ТаблицаЗаказовСборкаВАптеке = ТаблицаДокументов.Скопировать(Новый Структура("ТипКомплектацииЗаказа",Перечисления.ТипКомплектацииЗаказа.СборкаИКомплектацияВАптеке),"Документ,ЗСЯ");
	МассивЗаказовСборкаВАптеке = ТаблицаЗаказовСборкаВАптеке.ВыгрузитьКолонку("Документ");
		
	ТаблицаЗаказовКомплектацияИзКоробки = ТаблицаДокументов.Скопировать(Новый Структура("ТипКомплектацииЗаказа",Перечисления.ТипКомплектацииЗаказа.СборкаНаСкладеВКоробку_КомплектацияВАптеке),"Документ,ЗСЯ");
	МассивЗаказовКомплектацияИзКоробки = ТаблицаЗаказовКомплектацияИзКоробки.ВыгрузитьКолонку("Документ");
			
	ЭтоВозврат = Ложь;
	Если ВидОперации = перечисления.ТорговыеОперации.Продажа тогда
		Коэф = 1;
	Иначе
		Коэф = -1;
		ЭтоВозврат = Истина;
	КонецЕсли;
	
	Для каждого строка из Реализация цикл
		
		ДокументЗаполнен = ЗначениеЗаполнено(Строка.Документ);
		РеализацияПоЗаказу = ТипЗнч(Строка.Документ) = Тип("ДокументСсылка.Заказ") и ДокументЗаполнен;		
		СборкаЗаказаВАптеке = МассивЗаказовСборкаВАптеке.Найти(строка.Документ) <> неопределено и РеализацияПоЗаказу;
		СборкаЗаказаНаСкладеВКоробку = МассивЗаказовКомплектацияИзКоробки.Найти(строка.Документ) <> неопределено и РеализацияПоЗаказу;
		
		Движение = Движения.Реализация.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ДатаПродажи = Дата;
		Движение.Товар =  Строка.Товар;
		Движение.ККМ = ККМ;
		Движение.Отдел = Отдел;
		Движение.Партия = Строка.Партия;
		Движение.ТипОплаты = ТипОплаты;
		Движение.ДокументПродажи = Строка.Документ;
		Движение.Количество = (Коэф)*Строка.Количество;
		Движение.Скидка = (Коэф)*Строка.Скидка;
		Движение.Сумма = (Коэф)*Строка.Сумма;
		Движение.Себестоимость = (Коэф)*Строка.Себестоимость;
		Движение.СтавкаНДС = Строка.СтавкаНДС;
		Движение.СуммаНДС = Строка.СуммаНДС;
		Движение.Операция = ВидОперации;
		Движение.ТипЦены = Строка.ТипЦены;
		Движение.Всего = (Коэф)*Строка.Всего;
		
		Если Строка.Товар.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга тогда
			Продолжить;
		КонецЕсли;
		
		Если не РеализацияПоЗаказу тогда
			Движение = Движения.ОстаткиТовара.Добавить();
			Движение.ТипОперации = Перечисления.ТипыОпераций.РеализацияККМ;
			Движение.Период = Дата;
			Движение.Товар = Строка.Товар;
			Движение.Отдел = Отдел;
			Движение.Партия = Строка.Партия;
			Движение.Остаток = Строка.Количество;			
			Если ЭтоВозврат тогда
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Иначе
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			КонецЕсли;
		ИначеЕсли СборкаЗаказаВАптеке или СборкаЗаказаНаСкладеВКоробку тогда
			Если ЭтоВозврат тогда	
				Движение = Движения.ОстаткиТовара.ДобавитьПриход();
				Движение.ТипОперации = Перечисления.ТипыОпераций.ВозвратПокупателя;
				Движение.Период = Дата;
				Движение.Товар = Строка.Товар;
				Движение.Отдел = Отдел;
				Движение.Партия = Строка.Партия;
				Движение.Остаток = Строка.Количество;
			КонецЕсли;
		КонецЕсли;
		
		Если РеализацияПоЗаказу и (СборкаЗаказаВАптеке или СборкаЗаказаНаСкладеВКоробку) и НЕ ЭтоВозврат тогда			
			Движение = Движения.ХранениеЗСЯПоТоварам.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Склад = Отдел;
			Движение.Документ = Строка.Документ;
			Движение.Товар = Строка.Товар;
			Движение.Партия = Строка.Партия;
			Движение.ЗСЯ = Строка.ЗСЯ;
			Движение.Количество = Строка.Количество;			
		КонецЕсли;
		
	КонецЦикла;
		
	Если НЕ ЭтоВозврат тогда
		
		Для каждого строка из СписаниеПакетов цикл
			ДвижениеЗСЯ = Движения.ХранениеЗСЯ.ДобавитьРасход();	
			ДвижениеЗСЯ.Период = Дата;
			ДвижениеЗСЯ.Регистратор = Ссылка;
			ДвижениеЗСЯ.Склад = Отдел;
			ДвижениеЗСЯ.МестоЗаказа = строка.МестоЗаказа;
			ДвижениеЗСЯ.ЗСЯ = строка.ЗСЯ;
			ДвижениеЗСЯ.Документ = строка.Заказ;
			ДвижениеЗСЯ.Количество = строка.Количество;
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаЗаказов.ТипКомплектацииЗаказа,
		|	ТаблицаЗаказов.Документ,
		|	ТаблицаЗаказов.ЗСЯ
		|ПОМЕСТИТЬ втТаблицаЗаказов
		|ИЗ
		|	&ТаблицаДокументов КАК ТаблицаЗаказов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втТаблицаЗаказов.Документ,
		|	втТаблицаЗаказов.ЗСЯ
		|ПОМЕСТИТЬ втТаблицаЗаказовДляСписания
		|ИЗ
		|	втТаблицаЗаказов КАК втТаблицаЗаказов
		|ГДЕ
		|	втТаблицаЗаказов.ТипКомплектацииЗаказа <> ЗНАЧЕНИЕ(Перечисление.ТипКомплектацииЗаказа.СборкаНаСкладеВПакеты_РаскладкаПакетовВАптеке)
		|	И втТаблицаЗаказов.ЗСЯ <> ЗНАЧЕНИЕ(Справочник.МестоЗСЯ.ПустаяСсылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних.ЗСЯ,
		|	КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних.Заказ
		|ИЗ
		|	РегистрСведений.КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯ.СрезПоследних(
		|			&Граница,
		|			ЗСЯ В
		|				(ВЫБРАТЬ
		|					втТаблицаЗаказовДляСписания.ЗСЯ
		|				ИЗ
		|					втТаблицаЗаказовДляСписания КАК втТаблицаЗаказовДляСписания)) КАК КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втТаблицаЗаказовДляСписания КАК втТаблицаЗаказовДляСписания
		|		ПО КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних.ЗСЯ = втТаблицаЗаказовДляСписания.ЗСЯ
		|			И КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних.Заказ = втТаблицаЗаказовДляСписания.Документ
		|
		|СГРУППИРОВАТЬ ПО
		|	КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних.ЗСЯ,
		|	КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯСрезПоследних.Заказ";
		Запрос.УстановитьПараметр("Граница",Новый Граница(МоментВремени(),ВидГраницы.Исключая));
		Запрос.УстановитьПараметр("ТаблицаДокументов",ТаблицаДокументов);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() цикл
			ДвижениеЗСЯ = Движения.КомплектацияЗаказов_РаспределениеЗаказовПоЗСЯ.Добавить();	
			ДвижениеЗСЯ.Период = Дата;
			ДвижениеЗСЯ.Регистратор = Ссылка;
			ДвижениеЗСЯ.ЗСЯ = Выборка.ЗСЯ;
			ДвижениеЗСЯ.Заказ = Документы.Заказ.ПустаяСсылка();		
		КонецЦикла;
		
	Иначе
		ОбщиеФункцииСервер.СоздатьЦеныПартии(Отдел,Дата,Реализация.ВыгрузитьКолонку("Партия"));
	КонецЕсли;
	
	Если ТипОплаты = Перечисления.ТипОплаты.Наличные Тогда
		Движение = Движения.ДенежныеСредстваККМ.Добавить();
		Движение.Период = Дата;
		Движение.КассаККМ = ККМ;
		Движение.Сумма = СуммаДокумента;
		Если ЭтоВозврат Тогда
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Иначе
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		КонецЕсли; 
	КонецЕсли;
	
	Для Каждого строка из ТаблицаСкидочныеПрограммы цикл
		Движение = Движения.ТабПродажиАстраЗенека.Добавить();
		ЗаполнитьЗначенияСвойств(Движение,Строка);
		Движение.Период = Дата;
		Движение.Действует = НЕ ЭтоВозврат;
	КонецЦикла;
	
	Для Каждого строка из ИспользованныеБуклеты цикл
		Движение = Движения.t_astro_used_booklets.Добавить();
		ЗаполнитьЗначенияСвойств(Движение,Строка);
		Движение.Период = Дата;
		Движение.Действует = НЕ ЭтоВозврат;
	КонецЦикла;

	
	//ТаблицаДокументов = Реализация.Выгрузить(,"Документ");
	ТаблицаДокументов.Свернуть("Документ");
	Для каждого строка из ТаблицаДокументов цикл
		Если ЗначениеЗаполнено(Строка.Документ) и ТипЗнч(Строка.Документ) = Тип("ДокументСсылка.Заказ") тогда
			Статус = неопределено;
			Если ЭтоВозврат тогда
				Статус = Справочники.СтатусыОбработкиЗаказа.Пробит;
			Иначе
				Статус = Справочники.СтатусыОбработкиЗаказа.Пробит;
			КонецЕсли;
			СтатусыДокументов.УстановитьСтатусСборкиЗаказа(Строка.Документ,Ссылка,Статус,ПараметрыСеанса.ТекущийПользователь,Дата);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьТЧСписаниеПакетов() Экспорт
	Если ВидОперации = ПредопределенноеЗначение("Перечисление.ТорговыеОперации.Продажа") тогда
		СписаниеПакетов.Очистить();
		
		МассивЗаказов = Реализация.ВыгрузитьКолонку("Документ");	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХранениеЗСЯОстатки.Документ как Заказ,
		|	ХранениеЗСЯОстатки.МестоЗаказа,
		|	ХранениеЗСЯОстатки.ЗСЯ,
		|	СУММА(ХранениеЗСЯОстатки.КоличествоОстаток) КАК Количество
		|ИЗ
		|	РегистрНакопления.ХранениеЗСЯ.Остатки(
		|			&Граница,
		|			ВЫРАЗИТЬ(Документ КАК Документ.Заказ) В (&МассивЗаказов)
		|				И Склад = &Склад
		|				И ЕСТЬNULL(ВЫРАЗИТЬ(Документ КАК Документ.Заказ).ТипКомплектацииЗаказа, НЕОПРЕДЕЛЕНО) = ЗНАЧЕНИЕ(Перечисление.ТипКомплектацииЗаказа.СборкаНаСкладеВПакеты_РаскладкаПакетовВАптеке)) КАК ХранениеЗСЯОстатки
		|ГДЕ
		|	ХранениеЗСЯОстатки.МестоЗаказа <> ЗНАЧЕНИЕ(Справочник.НаклейкиМестЗаказа.ПустаяСсылка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ХранениеЗСЯОстатки.Документ,
		|	ХранениеЗСЯОстатки.МестоЗаказа,
		|	ХранениеЗСЯОстатки.ЗСЯ";
		Запрос.УстановитьПараметр("МассивЗаказов",МассивЗаказов);
		Запрос.УстановитьПараметр("Склад",Отдел);
		Запрос.УстановитьПараметр("Граница",Новый Граница(МоментВремени(),ВидГраницы.Исключая));
		Результат = Запрос.Выполнить();
		Если не Результат.Пустой() тогда
			Выборка = Результат.Выбрать();
			Пока Выборка.Следующий() цикл
				ЗаполнитьЗначенияСвойств(СписаниеПакетов.Добавить(),Выборка);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;                                                                                	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	СуммаДокумента = Реализация.Итог("Всего");
	
КонецПроцедуры
